RobCTs/IoT_Signal_analysis/components/components/soc/esp32h2/include/soc/mcpwm_struct.h
/** Type of gen_tstmp register
 *  Shadow register for register B.
 */
typedef union {
    struct {
        /** cmpr : R/W; bitpos: [15:0]; default: 0;
         *  PWM generator time stamp's shadow register
         */
        uint32_t cmpr:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_tstmp_reg_t;

/** Type of gen_cfg0 register
 *  Fault event T0 and T1 handling
 */
typedef union {
    struct {
        /** gen_cfg_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Update method for PWM generator's active register of configuration. When all bits
         *  are set to 0: immediately, when bit0 is set to 1: TEZ, when bit1 is set to
         *  1:TEP,when bit2 is set to 1:sync,when bit3 is set to 1:disable the update
         */
        uint32_t gen_cfg_upmethod:4;
        /** gen_t0_sel : R/W; bitpos: [6:4]; default: 0;
         *  Source selection for PWM generator event_t0, take effect immediately, 0:
         *  fault_event0, 1: fault_event1, 2: fault_event2, 3: sync_taken, 4: none
         */
        uint32_t gen_t0_sel:3;
        /** gen_t1_sel : R/W; bitpos: [9:7]; default: 0;
         *  Source selection for PWM generator event_t1, take effect immediately, 0:
         *  fault_event0, 1: fault_event1, 2: fault_event2, 3: sync_taken, 4: none
         */
        uint32_t gen_t1_sel:3;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} mcpwm_gen_cfg0_reg_t;

/** Type of gen_force register
 *  Permissives to force PWM0A and PWM0B outputs by software
 */
typedef union {
    struct {
        /** gen_cntuforce_upmethod : R/W; bitpos: [5:0]; default: 32;
         *  Updating method for continuous software force of PWM generator. When all bits are
         *  set to 0: immediately, when bit0 is set to 1: TEZ,,when bit1 is set to 1: TEP, when
         *  bit2 is set to 1: TEA, when bit3 is set to 1: TEB, when bit4 is set to 1: sync,
         *  when bit5 is set to 1: disable update. (TEA/B here and below means an event
         *  generated when the timer's value equals to that of register A/B.)
         */
        uint32_t gen_cntuforce_upmethod:6;
        /** gen_a_cntuforce_mode : R/W; bitpos: [7:6]; default: 0;
         *  Continuous software force mode for PWMnA. 0: disabled, 1: low, 2: high, 3: disabled
         */
        uint32_t gen_a_cntuforce_mode:2;
        /** gen_b_cntuforce_mode : R/W; bitpos: [9:8]; default: 0;
         *  Continuous software force mode for PWMnB. 0: disabled, 1: low, 2: high, 3: disabled
         */
        uint32_t gen_b_cntuforce_mode:2;
        /** gen_a_nciforce : R/W; bitpos: [10]; default: 0;
         *  Trigger of non-continuous immediate software-force event for PWMnA, a toggle will
         *  trigger a force event.
         */
        uint32_t gen_a_nciforce:1;
        /** gen_a_nciforce_mode : R/W; bitpos: [12:11]; default: 0;
         *  non-continuous immediate software force mode for PWMnA, 0: disabled, 1: low, 2:
         *  high, 3: disabled
         */
        uint32_t gen_a_nciforce_mode:2;
        /** gen_b_nciforce : R/W; bitpos: [13]; default: 0;
         *  Trigger of non-continuous immediate software-force event for PWMnB, a toggle will
         *  trigger a force event.
         */
        uint32_t gen_b_nciforce:1;
        /** gen_b_nciforce_mode : R/W; bitpos: [15:14]; default: 0;
         *  non-continuous immediate software force mode for PWMnB, 0: disabled, 1: low, 2:
         *  high, 3: disabled
         */
        uint32_t gen_b_nciforce_mode:2;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_gen_force_reg_t;

/** Type of gen register
 *  Actions triggered by events on PWM0B
 */
typedef union {
    struct {
        /** gen_utez : R/W; bitpos: [1:0]; default: 0;
         *  Action on PWMnA/B triggered by event TEZ when timer increasing
         */
        uint32_t gen_utez:2;
        /** gen_utep : R/W; bitpos: [3:2]; default: 0;
         *  Action on PWMnA/B triggered by event TEP when timer increasing
         */
        uint32_t gen_utep:2;
        /** gen_utea : R/W; bitpos: [5:4]; default: 0;
         *  Action on PWMnA/B triggered by event TEA when timer increasing
         */
        uint32_t gen_utea:2;
        /** gen_uteb : R/W; bitpos: [7:6]; default: 0;
         *  Action on PWMnA/B triggered by event TEB when timer increasing
         */
        uint32_t gen_uteb:2;
        /** gen_ut0 : R/W; bitpos: [9:8]; default: 0;
         *  Action on PWMnA/B triggered by event_t0 when timer increasing
         */
        uint32_t gen_ut0:2;
        /** gen_ut1 : R/W; bitpos: [11:10]; default: 0;
         *  Action on PWMnA/B triggered by event_t1 when timer increasing
         */
        uint32_t gen_ut1:2;
        /** gen_dtez : R/W; bitpos: [13:12]; default: 0;
         *  Action on PWMnA/B triggered by event TEZ when timer decreasing
         */
        uint32_t gen_dtez:2;
        /** gen_dtep : R/W; bitpos: [15:14]; default: 0;
         *  Action on PWMnA/B triggered by event TEP when timer decreasing
         */
        uint32_t gen_dtep:2;
        /** gen_dtea : R/W; bitpos: [17:16]; default: 0;
         *  Action on PWMnA/B triggered by event TEA when timer decreasing
         */
        uint32_t gen_dtea:2;
        /** gen_dteb : R/W; bitpos: [19:18]; default: 0;
         *  Action on PWMnA/B triggered by event TEB when timer decreasing
         */
        uint32_t gen_dteb:2;
        /** gen_dt0 : R/W; bitpos: [21:20]; default: 0;
         *  Action on PWMnA/B triggered by event_t0 when timer decreasing
         */
        uint32_t gen_dt0:2;
        /** gen_dt1 : R/W; bitpos: [23:22]; default: 0;
         *  Action on PWMnA/B triggered by event_t1 when timer decreasing. 0: no change, 1: low,
         *  2: high, 3: toggle
         */
        uint32_t gen_dt1:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_gen_reg_t;

/** Type of dt_cfg register
 *  dead time type selection and configuration
 */
typedef union {
    struct {
        /** db_fed_upmethod : R/W; bitpos: [3:0]; default: 0;
         *  Update method for FED (rising edge delay) active register. 0: immediate, when bit0
         *  is set to 1: tez, when bit1 is set to 1:tep,  when bit2 is set to 1: sync, when
         *  bit3 is set to 1: disable the update
         */
        uint32_t db_fed_upmethod:4;
        /** db_red_upmethod : R/W; bitpos: [7:4]; default: 0;
         *  Update method for RED (rising edge delay) active register. 0: immediate, when bit0
         *  is set to 1: tez, when bit1 is set to 1:tep,  when bit2 is set to 1: sync, when
         *  bit3 is set to 1: disable the update
         */
        uint32_t db_red_upmethod:4;
        /** db_deb_mode : R/W; bitpos: [8]; default: 0;
         *  S8 in table, dual-edge B mode, 0: fed/red take effect on different path separately,
         *  1: fed/red take effect on B path, A out is in bypass or dulpB mode
         */
        uint32_t db_deb_mode:1;
        /** db_a_outswap : R/W; bitpos: [9]; default: 0;
         *  S6 in table
         */
        uint32_t db_a_outswap:1;
        /** db_b_outswap : R/W; bitpos: [10]; default: 0;
         *  S7 in table
         */
        uint32_t db_b_outswap:1;
        /** db_red_insel : R/W; bitpos: [11]; default: 0;
         *  S4 in table
         */
        uint32_t db_red_insel:1;
        /** db_fed_insel : R/W; bitpos: [12]; default: 0;
         *  S5 in table
         */
        uint32_t db_fed_insel:1;
        /** db_red_outinvert : R/W; bitpos: [13]; default: 0;
         *  S2 in table
         */
        uint32_t db_red_outinvert:1;
        /** db_fed_outinvert : R/W; bitpos: [14]; default: 0;
         *  S3 in table
         */
        uint32_t db_fed_outinvert:1;
        /** db_a_outbypass : R/W; bitpos: [15]; default: 1;
         *  S1 in table
         */
        uint32_t db_a_outbypass:1;
        /** db_b_outbypass : R/W; bitpos: [16]; default: 1;
         *  S0 in table
         */
        uint32_t db_b_outbypass:1;
        /** db_clk_sel : R/W; bitpos: [17]; default: 0;
         *  Dead time generator n clock selection. 0: PWM_clk, 1: PT_clk
         */
        uint32_t db_clk_sel:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} mcpwm_dt_cfg_reg_t;

/** Type of dt_fed_cfg register
 *  Shadow register for falling edge delay (FED).
 */
typedef union {
    struct {
        /** db_fed : R/W; bitpos: [15:0]; default: 0;
         *  Shadow register for FED
         */
        uint32_t db_fed:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_fed_cfg_reg_t;

/** Type of dt_red_cfg register
 *  Shadow register for rising edge delay (RED).
 */
typedef union {
    struct {
        /** db_red : R/W; bitpos: [15:0]; default: 0;
         *  Shadow register for RED
         */
        uint32_t db_red:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} mcpwm_dt_red_cfg_reg_t;

/** Type of carrier_cfg register
 *  Carrier enable and configuratoin
 */
typedef union {
    struct {
        /** chopper_en : R/W; bitpos: [0]; default: 0;
         *  When set, carrier0 function is enabled. When cleared, carrier0 is bypassed
         */
        uint32_t chopper_en:1;
        /** chopper_prescale : R/W; bitpos: [4:1]; default: 0;
         *  PWM carrier0 clock (PC_clk) prescale value. Period of PC_clk = period of PWM_clk *
         *  (PWM_CARRIER0_PRESCALE + 1)
         */
        uint32_t chopper_prescale:4;
        /** chopper_duty : R/W; bitpos: [7:5]; default: 0;
         *  carrier duty selection. Duty = PWM_CARRIER0_DUTY / 8
         */
        uint32_t chopper_duty:3;
        /** chopper_oshtwth : R/W; bitpos: [11:8]; default: 0;
         *  width of the first pulse in number of periods of the carrier
         */
        uint32_t chopper_oshtwth:4;
        /** chopper_out_invert : R/W; bitpos: [12]; default: 0;
         *  when set, invert the output of PWM0A and PWM0B for this submodule
         */
        uint32_t chopper_out_invert:1;
        /** chopper_in_invert : R/W; bitpos: [13]; default: 0;
         *  when set, invert the input of PWM0A and PWM0B for this submodule
         */
        uint32_t chopper_in_invert:1;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} mcpwm_carrier_cfg_reg_t;

/** Type of fh_cfg0 register
 *  Actions on PWM0A and PWM0B trip events
 */
typedef union {
    struct {
        /** tz_sw_cbc : R/W; bitpos: [0]; default: 0;
         *  Enable register for software force cycle-by-cycle mode action. 0: disable, 1: enable
         */
        uint32_t tz_sw_cbc:1;
        /** tz_f2_cbc : R/W; bitpos: [1]; default: 0;
         *  event_f2 will trigger cycle-by-cycle mode action. 0: disable, 1: enable
         */
        uint32_t tz_f2_cbc:1;
        /** tz_f1_cbc : R/W; bitpos: [2]; default: 0;
         *  event_f1 will trigger cycle-by-cycle mode action. 0: disable, 1: enable
         */
        uint32_t tz_f1_cbc:1;
        /** tz_f0_cbc : R/W; bitpos: [3]; default: 0;
         *  event_f0 will trigger cycle-by-cycle mode action. 0: disable, 1: enable
         */
        uint32_t tz_f0_cbc:1;
        /** tz_sw_ost : R/W; bitpos: [4]; default: 0;
         *  Enable register for software force one-shot mode action. 0: disable, 1: enable
         */
        uint32_t tz_sw_ost:1;
        /** tz_f2_ost : R/W; bitpos: [5]; default: 0;
         *  event_f2 will trigger one-shot mode action. 0: disable, 1: enable
         */
        uint32_t tz_f2_ost:1;
        /** tz_f1_ost : R/W; bitpos: [6]; default: 0;
         *  event_f1 will trigger one-shot mode action. 0: disable, 1: enable
         */
        uint32_t tz_f1_ost:1;
        /** tz_f0_ost : R/W; bitpos: [7]; default: 0;
         *  event_f0 will trigger one-shot mode action. 0: disable, 1: enable
         */
        uint32_t tz_f0_ost:1;
        /** tz_a_cbc_d : R/W; bitpos: [9:8]; default: 0;
         *  Cycle-by-cycle mode action on PWM0A when fault event occurs and timer is
         *  decreasing. 0: do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_a_cbc_d:2;
        /** tz_a_cbc_u : R/W; bitpos: [11:10]; default: 0;
         *  Cycle-by-cycle mode action on PWM0A when fault event occurs and timer is
         *  increasing. 0: do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_a_cbc_u:2;
        /** tz_a_ost_d : R/W; bitpos: [13:12]; default: 0;
         *  One-shot mode action on PWM0A when fault event occurs and timer is decreasing. 0:
         *  do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_a_ost_d:2;
        /** tz_a_ost_u : R/W; bitpos: [15:14]; default: 0;
         *  One-shot mode action on PWM0A when fault event occurs and timer is increasing. 0:
         *  do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_a_ost_u:2;
        /** tz_b_cbc_d : R/W; bitpos: [17:16]; default: 0;
         *  Cycle-by-cycle mode action on PWM0B when fault event occurs and timer is
         *  decreasing. 0: do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_b_cbc_d:2;
        /** tz_b_cbc_u : R/W; bitpos: [19:18]; default: 0;
         *  Cycle-by-cycle mode action on PWM0B when fault event occurs and timer is
         *  increasing. 0: do nothing,1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_b_cbc_u:2;
        /** tz_b_ost_d : R/W; bitpos: [21:20]; default: 0;
         *  One-shot mode action on PWM0B when fault event occurs and timer is decreasing. 0:
         *  do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_b_ost_d:2;
        /** tz_b_ost_u : R/W; bitpos: [23:22]; default: 0;
         *  One-shot mode action on PWM0B when fault event occurs and timer is increasing. 0:
         *  do nothing, 1: force low, 2: force high, 3: toggle
         */
        uint32_t tz_b_ost_u:2;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} mcpwm_fh_cfg0_reg_t;

/** Type of fh_cfg1 register
 *  Software triggers for fault handler actions
 */
typedef union {
    struct {
        /** tz_clr_ost : R/W; bitpos: [0]; default: 0;
         *  a rising edge will clear on going one-shot mode action
         */
        uint32_t tz_clr_ost:1;
        /** tz_cbcpulse : R/W; bitpos: [2:1]; default: 0;
         *  cycle-by-cycle mode action refresh moment selection. When bit0 is set to 1: TEZ,
         *  when bit1 is set to 1:TEP
         */
        uint32_t tz_cbcpulse:2;
        /** tz_force_cbc : R/W; bitpos: [3]; default: 0;
         *  a toggle trigger a cycle-by-cycle mode action
         */
        uint32_t tz_force_cbc:1;
        /** tz_force_ost : R/W; bitpos: [4]; default: 0;
         *  a toggle (software negate its value) triggers a one-shot mode action
         */
        uint32_t tz_force_ost:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} mcpwm_fh_cfg1_reg_t;

/** Type of fh_status register
 *  Status of fault events.
 */
typedef union {
    struct {
        /** tz_cbc_on : RO; bitpos: [0]; default: 0;
         *  Set and reset by hardware. If set, a cycle-by-cycle mode action is on going
         */
        uint32_t tz_cbc_on:1;
        /** tz_ost_on : RO; bitpos: [1]; default: 0;
         *  Set and reset by hardware. If set, an one-shot mode action is on going
         */
        uint32_t tz_ost_on:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} mcpwm_fh_status_reg_t;


/** Group: Fault Detection Configuration and Status */
/** Type of fault_detect register
 *  Fault detection configuration and status
 */
typedef union {
    struct {
        /** f0_en : R/W; bitpos: [0]; default: 0;
         *  When set, event_f0 generation is enabled
         */
        uint32_t f0_en:1;
        /** f1_en : R/W; bitpos: [1]; default: 0;
         *  When set, event_f1 generation is enabled
         */
        uint32_t f1_en:1;
        /** f2_en : R/W; bitpos: [2]; default: 0;
         *  When set, event_f2 generation is enabled
         */
        uint32_t f2_en:1;
        /** f0_pole : R/W; bitpos: [3]; default: 0;
         *  Set event_f0 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1:
         *  level high
         */
        uint32_t f0_pole:1;
        /** f1_pole : R/W; bitpos: [4]; default: 0;
         *  Set event_f1 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1:
         *  level high
         */
        uint32_t f1_pole:1;
        /** f2_pole : R/W; bitpos: [5]; default: 0;
         *  Set event_f2 trigger polarity on FAULT2 source from GPIO matrix. 0: level low, 1:
         *  level high
         */
        uint32_t f2_pole:1;
        /** event_f0 : RO; bitpos: [6]; default: 0;
         *  Set and reset by hardware. If set, event_f0 is on going
         */
        uint32_t event_f0:1;
        /** event_f1 : RO; bitpos: [7]; default: 0;
         *  Set and reset by hardware. If set, event_f1 is on going
         */
        uint32_t event_f1:1;
        /** event_f2 : RO; bitpos: [8]; default: 0;
         *  Set and reset by hardware. If set, event_f2 is on going
         */
        uint32_t event_f2:1;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} mcpwm_fault_detect_reg_t;


/** Group: Capture Configuration and Status */
/** Type of cap_timer_cfg register
 *  Configure capture timer
 */
typedef union {
    struct {
        /** cap_timer_en : R/W; bitpos: [0]; default: 0;
         *  When set, capture timer incrementing under APB_clk is enabled.
         */
        uint32_t cap_timer_en:1;
        /** cap_synci_en : R/W; bitpos: [1]; default: 0;
         *  When set, capture timer sync is enabled.
         */
        uint32_t cap_synci_en:1;
        /** cap_synci_sel : R/W; bitpos: [4:2]; default: 0;
         *  capture module sync input selection. 0: none, 1: timer0 sync_out, 2: timer1
         *  sync_out, 3: timer2 sync_out, 4: SYNC0 from GPIO matrix, 5: SYNC1 from GPIO matrix,
         *  6: SYNC2 from GPIO matrix
         */
        uint32_t cap_synci_sel:3;
        /** cap_sync_sw : WT; bitpos: [5]; default: 0;
         *  When reg_cap_synci_en is 1,  write 1 will trigger a capture timer sync, capture
         *  timer is loaded with value in phase register.
         */
        uint32_t cap_sync_sw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} mcpwm_cap_timer_cfg_reg_t;

